xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2013)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                            **
**  $FILENAME   : Port.c $                                                   **
**                                                                            **
**  $CC VERSION : \main\dev_tc23x_as4.0.3\22 $                               **
**                                                                            **
**  $DATE       : 2017-03-16 $                                               **
**                                                                            **
**  AUTHOR       : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**  VENDOR       : Infineon Technologies                                      **
**                                                                            **
**  DESCRIPTION  : This file contains                                         **
**                 - functionality of Port driver.                            **
**                                                                            **
**  MAY BE CHANGED BY USER [Yes/No]: No                                       **
**                                                                            **
*******************************************************************************/
/*  TRACEABILITY : [cover parentID=DS_AS_PORT107_PORT146_4,DS_NAS_PORT_PR127,
                    SAS_NAS_PORT_PR913,DS_AS40X_PORT114,DS_NAS_PORT_PR131,
                    DS_NAS_PORT_PR228,DS_AS_PORT107_PORT146,SAS_NAS_ALL_PR1652,
                    SAS_AS_PORT080_PORT108_PORT130_PORT131_PORT133_PORT208,
                    SAS_NAS_PORT_PR734,SAS_NAS_ALL_PR749,
                    SAS_NAS_ALL_PR630_PR631,
                    SAS_NAS_ALL_PR70]
                   [/cover]                                                   */
/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/

/* Inclusion of Tasking sfr file */

#include "IfxPort_reg.h"

/* Global functions like Set/Reset END INIT protection bit,
  Enable/Disable interrupts, Automic write function */
#include "Mcal.h"

/* Own header file, this includes own configuration file also */
/* PORT080: Inclusion structure */
#include "Port.h"

/*AS and SW version Specific include file */
#include "Port_Ver.h"

/* Inclusion from Safety Error */
#if (PORT_SAFETY_ENABLE == STD_ON)
#include "SafetyReport.h"
#endif

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/

/*
  Offset definitions for data in Port configuration
*/
/* Initial Control data offset */
#define PORT_DATA_OFS_CTL      (0U)
/* Initial level data offset */
#define PORT_DATA_OFS_LEVEL    (4U)

/* If pin mode changeable is enabled */
#if (PORT_SET_PIN_MODE_API == STD_ON)
/* Pin mode changeable or not offset */
#define PORT_DATA_OFS_MODE     (7U)

#endif /* (PORT_SET_PIN_MODE_API) */

/* If Direction changeable is enabled */
#if (PORT_SET_PIN_DIRECTION_API == STD_ON)
/* If pin mode changeable is enabled */
#if (PORT_SET_PIN_MODE_API == STD_ON)
/* Pin direction data offset */
#define PORT_DATA_OFS_DIR      (8U)
/* Control data 2 offset */
#define PORT_DATA_OFS_CTL2     (9U)

#else
/* Pin direction data offset */
#define PORT_DATA_OFS_DIR      (7U)
/* Control data 2 offset */
#define PORT_DATA_OFS_CTL2     (8U)

#endif /* (PORT_SET_PIN_MODE_API) */
#endif /* (PORT_SET_PIN_DIRECTION_API) */

#if((PORT_SET_PIN_DIRECTION_API == STD_ON) || (PORT_SET_PIN_MODE_API == STD_ON))
/* Mask to get direction info from Pin control value */
#define PORT_DIR_MSK           (0x80U)
#endif

/* IOCR0 register offset in Ifx_P */
#define PORT_IOCR0_REG_OFFSET  (4U)

/* PCSR register offset in Ifx_P */
#define PORT_PCSR_REG_OFFSET   (0x19U)

#if(PORT_DEV_ERROR_DETECT == STD_ON)
/* Status to indicate that PORT is initialized */
#define PORT_INITIALIZED  ((uint8)1)
#endif  /*(PORT_DEV_ERROR_DETECT == STD_ON)*/

/* Before Setting the Iocr register, To Check the Port number below
   macro's are used */

#define PORT_PIN_0_3           (0x000F)
#define PORT_PIN_4_7           (0x00F0)
#define PORT_PIN_8_11          (0x0F00)
#define PORT_PIN_12_15         (0xF000)

/* 8-bit mask value from 8th to 15th bit */
#define PORT_PDR1_MASK         (0xFF00U)

#if((PORT_SET_PIN_DIRECTION_API == STD_ON) || (PORT_SET_PIN_MODE_API == STD_ON))
/* offset value where the port number is present */
#define PORT_NUMBER_OFFSET     (4U)

/* lower 8-bit mask value in hex to get the port number */
#define PORT_NUM_LOW8_MASK     (0x000000FFU)

/* lower 4-bit mask value in hex to get the pin number of a port */
#define PORT_PIN_LOW4_MASK     (0x0FU)

#endif

/* lower 16-bit mask value in Hex */
#define PORT_LOWER_16BIT_MASK  (0x0000FFFFU)

/* 16-bit shift value */
#define PORT_16BIT_SHIFTVALUE  (16U)
#define PORT_NUM_EIGHT         (8U)
#define PORT_NUM_FOUR          (4U)

