xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
/* general constants */
#define PORT_CONSTANT_16       (16U)
#define PORT_CONSTANT_10       (10U)
#define PORT_NUMBER_32         (32U)
#define PORT_NUMBER_31         (31U)
#define PORT_CONSTANT_0x01     (0x01U)


#if (PORT_SET_PIN_MODE_API == STD_ON)
#if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))

/* Available Inverted Port Mask */
#define AVAILABLE_MODE_MASK    ((Port_PinModeType)(0xC7U))

#endif /*(PORT_SET_PIN_MODE_API==STD_ON) */
#endif
/* ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))*/

/* Maximum port pin number */
#define PORT_PIN_MAX_NUMBER    (15U)

/* Mcal Safety ENDINIT Timeout value */
#define PORT_ENDINIT_TIMEOUT   (150000U)

/* Mask for valid bits */
#define PORT_IOCR0_PIN_SHIFT_MASK             (0x000000F8U)
#if (PORT_SET_PIN_MODE_API == STD_ON)
#define PORT_IOCR0_MODE_SHIFT_MASK            (0x00000038U)
#endif /* (PORT_SET_PIN_MODE_API == STD_ON)*/

/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define PORT_IOCR0_BIT_SHIFT_COUNT(Pin)       (PORT_NUM_EIGHT * \
                                              ((Pin) % (PORT_NUM_FOUR)))

/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define PORT_PIN_IOCR0_SETMASK(Pin)      ((uint32)PORT_IOCR0_PIN_SHIFT_MASK << \
                                               PORT_IOCR0_BIT_SHIFT_COUNT(Pin))

/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define PORT_PIN_IOCR0_CLEARMASK(Pin)         (~PORT_PIN_IOCR0_SETMASK(Pin))

#if (PORT_SET_PIN_MODE_API == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define PORT_IOCR0_MODE_SETMASK(Pin)   ((uint32)PORT_IOCR0_MODE_SHIFT_MASK << \
                                               PORT_IOCR0_BIT_SHIFT_COUNT(Pin))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define PORT_IOCR0_MODE_CLEARMASK(Pin)        (~PORT_IOCR0_MODE_SETMASK(Pin))
#endif /* (PORT_SET_PIN_MODE_API == STD_ON)*/

/*******************************************************************************
**                   Function like macro definitions                          **
*******************************************************************************/

/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/

#define PORT_START_SEC_CODE
/*mapping of code and data to specific memory sections via memory mapping file*/
#include "MemMap.h"

/*INLINE function to initialize Port module*/
IFX_LOCAL_INLINE void Port_lIOInit(void);

/*INLINE function to initialize Port module*/
IFX_LOCAL_INLINE void Port_lPDRInit(void);

/*INLINE function to extract the Address of Px_OUT register */
IFX_LOCAL_INLINE Ifx_P *Port_lAdr(uint32 PortNumber);

/*INLINE function to to check if the port
  is available or not for the microcontroller */
IFX_LOCAL_INLINE uint32 Port_lIsPortAvailable31(uint32 Port);

/*INLINE function to check if the port
  is available or not for the microcontroller */
IFX_LOCAL_INLINE uint32 Port_lIsPortAvailable40(uint32 Port);

/*INLINE function to check if the port is
  available or not for the microcontroller    */
IFX_LOCAL_INLINE uint32 Port_lIsPortAvailable(uint32 Port);

/*INLINE function to check if the port is read only or it is writable */
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly31(uint32 Port);

/*INLINE function to check if the port is read only or it is writable */
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly40(uint32 Port);

/*INLINE function to check if the port is read only or it is writable*/
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly(uint32 Port);

/*INLINE function to check if the port pin is
  available or not for the microcontroller      */
IFX_LOCAL_INLINE uint16 Port_lIsPinAvailable(uint32 Port,uint32 Pin);

/*INLINE function to check if any of the
  portpin 8-15 is available or not for the micro*/
IFX_LOCAL_INLINE uint16 Port_lIsPortPdr1Available(uint32 Port);

/*INLINE function to check if the IOCRx register for the port
   is available or not for the micro */
IFX_LOCAL_INLINE uint16 Port_lIsPortIocrAvailable(uint32 Port,uint16 Pin);

#if (PORT_SET_PIN_MODE_API == STD_ON)
#if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))

/*INLINE function to check the error
  in the Port_SetPinMode Api  */
IFX_LOCAL_INLINE uint32 Port_lModeErrChk
(
  uint8 Dir, Port_PinModeType Mode, uint32 ConfigIndex, uint32 PinNumber
);
IFX_LOCAL_INLINE uint8 Port_lChkPin
(
  Port_PinType Pin,uint32 PortNo,uint32 PinNo
);
#endif
/*(PORT_SET_PIN_MODE_API==STD_ON) */
#endif
/* ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))*/

/*INLINE function for OMR register value
  to set the configured initial level      */
IFX_LOCAL_INLINE uint32 Port_lPinLevel(uint32 Level);

#if((PORT_SET_PIN_DIRECTION_API == STD_ON) || (PORT_SET_PIN_MODE_API == STD_ON))
/*INLINE function to extract port number Port_PinType data */
IFX_LOCAL_INLINE uint32 Port_lNumber(Port_PinType Pin);

/*INLINE function to extract pin number from Port_PinType data*/
IFX_LOCAL_INLINE uint32 Port_lPinNumber(Port_PinType Pin);
#endif

/*INLINE function to to check if the port supports PCSR
   for the microcontroller */
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable31(uint32 Port);

/*INLINE function to to check if the port supports PCSR
   for the microcontroller */
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable40(uint32 Port);

/*INLINE function to to check if the port supports PCSR
   for the microcontroller */
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable(uint32 Port);

#if (PORT_INIT_CHECK_API == STD_ON)
IFX_LOCAL_INLINE uint8 Port_lChkIocr(uint32 PortNo,const uint32 *DataPtr);
IFX_LOCAL_INLINE uint8 Port_lChkPDR(uint32 PortNo,uint32 Data_PDR0,
                                   uint32 Data_PDR1);
#endif

#define PORT_STOP_SEC_CODE
/*mapping of code and data to specific memory sections via memory mapping file*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"

