xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
  #if(PORT_PB_FIXEDADDR == STD_OFF)

  if (ConfigPtr == NULL_PTR)
  {

    /* Report PORT_E_PARAM_CONFIG DET */
    #if (PORT_DEV_ERROR_DETECT == STD_ON)
    Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
        PORT_SID_INIT,PORT_E_PARAM_CONFIG);
    #endif
    /* PORT087: Skip the API functionality and return from the API */

    /* Report a safety error */
    #if (PORT_SAFETY_ENABLE == STD_ON)
    SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
                     PORT_SID_INIT,PORT_E_PARAM_CONFIG);
    #endif

    ErrStatus = 1U;
  }
  #else
  if (ConfigPtr != Port_kConfigPtr)
  {

    /* Report PORT_E_PARAM_CONFIG DET */
    #if (PORT_DEV_ERROR_DETECT == STD_ON)
    Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
      PORT_SID_INIT,PORT_E_PARAM_CONFIG);
    #endif
    /* PORT087: Skip the API functionality and return from the API */

    /* Report a safety error */
    #if (PORT_SAFETY_ENABLE == STD_ON)
    SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
                     PORT_SID_INIT,PORT_E_PARAM_CONFIG);
    #endif

    ErrStatus = 1U;
  }
  #endif /*(PORT_PB_FIXEDADDR == STD_ON)*/

  #if (PORT_SAFETY_ENABLE == STD_ON)
  if ((ErrStatus != 1U) &&
      (ConfigPtr->PortMarker != ((uint32)PORT_MODULE_ID << 16U)))
  {
    /* report to upper layer */
    SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
                     PORT_SID_INIT,PORT_E_PARAM_CONFIG);
    ErrStatus = 1U;

  }
  #endif
  /*End Of PORT_SAFETY_ENABLE*/
  #endif
  /*(PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON)*/


  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  if (ErrStatus == 0U)
  #endif
  {
    /* PORT002: The function Port_Init() shall also initialize all variables
       used by the PORT driver module to an initial state.
       There are no such variables in the port module
    */
    #if(PORT_PB_FIXEDADDR == STD_OFF)
      Port_kConfigPtr = ConfigPtr;
    #else
      /* To remove GNU warning of unused parameter ConfigPtr */
      UNUSED_PARAMETER(ConfigPtr)
    #endif  /*(PORT_PB_FIXEDADDR == STD_OFF)*/

    /* Initialise General Purpose I/O Ports and Peripheral I/O Lines */
    Port_lIOInit();

    #if(PORT_DEV_ERROR_DETECT == STD_ON)
    /* Set Status to indicate that initialization is done */
    Port_InitStatus = PORT_INITIALIZED;
    #endif
  }
}/* Port_Init */


#if (PORT_INIT_CHECK_API == STD_ON)
/*******************************************************************************
** Traceability     : [cover parentID=SAS_MCAL_PORT_0402,
                      SAS_MCAL_PORT_0405,SAS_MCAL_PORT_0406,
                      SAS_MCAL_PORT_0407,SAS_MCAL_PORT_0431,
                      DS_MCAL_PORT_0403,DS_MCAL_PORT_0403_1,
                      DS_MCAL_PORT_0404,DS_MCAL_PORT_0405,
                      DS_MCAL_PORT_0406,DS_MCAL_PORT_0417,
                      DS_NAS_PORT_PR123]                                      **
**                                                                            **
** Syntax           : Std_ReturnType Port_InitCheck                           **
**                    (                                                       **
**                      const Port_ConfigType * ConfigPtr                     **
**                    )                                                       **
** [/cover]                                                                   **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : const Port_ConfigType * ConfigPtr - Pointer to          **
**                    PORT configuration                                      **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : Std_ReturnType                                          **
**                                                                            **
** Description      : This function checks Port SFR's and Global              **
**                      variables initialized by Port_Init Api                **
**                    This API is available only if PortInitCheckApi is TRUE  **
*******************************************************************************/
Std_ReturnType Port_InitCheck ( const Port_ConfigType * ConfigPtr )
{

  uint8 ErrStatus;
  uint8 ErrPdr;
  uint32 PortNumber;
  /* Index to identify the port configuration information
  from the configuration array  */
  uint8 ConfigIndex;
  Ifx_P  *PortAddressPtr;

  const uint32 *DataPtr;
  const Port_n_ConfigType *ConfigDataPtr;

  const uint32  *PCSRDataPtr;
  volatile uint32  *PCSRRegPtr;

  uint8 LevelFlag;
  uint8 IocrFlag;


  uint8 PCSRFlag;

  ErrStatus = E_OK;
  ConfigIndex = 0U;
  LevelFlag = 1U;
  PCSRFlag = 1U;


  if (Port_kConfigPtr != ConfigPtr)
  {

     ErrStatus = E_NOT_OK;
  }
  else
  {

    PCSRDataPtr = (const uint32*)(const void*)
                               (Port_kConfigPtr->Port_PCSRConfigTypePtr);

    for (PortNumber = 0U; PortNumber <= PORT_MAX_NUMBER ; PortNumber++)
    {

      /* Parameter Port is checked for validity */
      if(Port_lIsPortAvailable(PortNumber) != 0U)
      {

        /* Check PDR Registers Initialization */

        /* Port driver strength is configured in Port PDR0 register */

        PortAddressPtr = Port_lAdr(PortNumber);

        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
        /*IFX_MISRA_RULE_17_04_STATUS= Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
        ErrPdr = Port_lChkPDR(PortNumber,
        Port_kConfigPtr->PortConfigSetPtr[ConfigIndex].DriverStrength0,
        Port_kConfigPtr->PortConfigSetPtr[ConfigIndex].DriverStrength1);

        if (ErrPdr == 0U)
        {
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
          ConfigDataPtr = (Port_kConfigPtr->PortConfigSetPtr) + ConfigIndex ;

          /* Address of each port configuration */
          DataPtr = (const uint32 *)(const void*)(ConfigDataPtr);


