xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
          /* Check Port Level Registers Initialization */

          if(Port_lIsPortReadOnly(PortNumber) == 0U)
          {
            /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
              to efficiently access the SFRs of PORT*/
            if(PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->OUT.U) == \
                                             (*(DataPtr + PORT_DATA_OFS_LEVEL)))
            {
              LevelFlag = 0U;
            }
          }
          else
          {
             LevelFlag = 0U;
          }

          if (LevelFlag == 0U)
          {

             /* Check IOCR0,4,8,12 Registers Initialization */

             IocrFlag = Port_lChkIocr(PortNumber,DataPtr);

             if (IocrFlag == 0U)
             {
               /* Check Port  PCSR Registers Initialization */
                 if(Port_lIsPortPCSRAvailable(PortNumber) != 0U)
                 {
                   /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
                     to efficiently access the SFRs of PORT*/
                   PCSRRegPtr = ((volatile uint32*)
                                 (volatile void*)PortAddressPtr +
                                  PORT_PCSR_REG_OFFSET);
                   if (PORT_SFR_INIT_USER_MODE_READ32(*PCSRRegPtr)\
                                                                == *PCSRDataPtr)
                   {
                     PCSRFlag = 0U;
                   }
                   /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
                     due to PBConfigStructure and is within allowed range.*/
                   PCSRDataPtr++;
                 }
                 /* PCSR is not available then make PCSRFlag as FALSE */
                 else
                 {
                    PCSRFlag = 0U;
                 }
             }
          }
        }
        /* If  PCSRFlag as True, then return as error */
        if(PCSRFlag != 0U)
        {
           ErrStatus = E_NOT_OK;
           break;
        }
     ConfigIndex++;
     }

     LevelFlag = 1U;
     PCSRFlag = 1U;

     if(PortNumber == PORT_MAX_NUMBER)
     {
         /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
           to efficiently access the SFRs of PORT*/
       if (PORT_SFR_INIT_USER_MODE_READ32(P40_PDISC.U) != \
                                                 Port_kConfigPtr->PDiscSet[0U])
       {
         ErrStatus = E_NOT_OK;
       }
         /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
           to efficiently access the SFRs of PORT*/
       if (PORT_SFR_INIT_USER_MODE_READ32(P41_PDISC.U) != \
                                                 Port_kConfigPtr->PDiscSet[1U])
       {
         ErrStatus = E_NOT_OK;
       }
     }
    } /* For loop */
  } /* Else */
  return(ErrStatus);
}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint8 Port_lChkPDR                     **
**                    (                                                       **
**                      uint32 PortNo,uint32 Data_PDR0, uint32 Data_PDR1      **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 PortNo - Port number whose  PDR to be checked    **
**                    uint32 Data_PDR0 - Data of DriverStrength0              **
**                    uint32 Data_PDR1 - Data of DriverStrength1              **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint8                                                   **
**                    0- No error if PDR value is correct                     **
**                    1- Error if PDR value is not correct                    **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if configured  Port PDR value is     **
**    same as read PDR value                                                  **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 Port_lChkPDR(uint32 PortNo,uint32 Data_PDR0,
                                   uint32 Data_PDR1)
{
  uint8 ErrPdr = 0U;
  Ifx_P  *PortAddressPtr;

  PortAddressPtr = Port_lAdr(PortNo);

  if(PortNo < PORT_MAX_NUMBER)
  {
    if(PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->PDR0.U) != Data_PDR0)
    {
      ErrPdr = 1U;
    }

    if(Port_lIsPortPdr1Available(PortNo) != 0U)
    {

      if(PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->PDR1.U) != Data_PDR1)
      {
        ErrPdr = 1U;
      }
    }
  }
  return(ErrPdr);
}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint8 Port_lChkIocr                    **
**                    (                                                       **
**                      uint32 PortNo,const uint32 *DataPtr                   **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 PortNo - Port number whose Iocr to be checked    **
**                    const uint32 *DataPtr - Data read from Iocr register    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint8                                                   **
**                    0 -No error if Iocr register value is correct           **
**                    1 -Error if Iocr register  value is not correct         **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if configured  Port Iocr value is    **
**    same as read Iocr value                                                 **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 Port_lChkIocr(uint32 PortNo,const uint32 *DataPtr)
{
  uint8 RetVal;
  Ifx_P  *PortAddressPtr;
  uint32 Index;
  uint16 PinAvailable;
  uint32 PinMask;
  uint8 PinPosition;

  RetVal = 0U;

  PortAddressPtr = Port_lAdr(PortNo);

  if(Port_lIsPortIocrAvailable(PortNo,(uint16)PORT_PIN_0_3)!= 0U)
  {
    PinPosition = 0U;
    PinMask = 0U;
    for(Index = 0U; Index<4U ; Index++)
    {

       PinAvailable  = Port_lIsPinAvailable(PortNo,Index);

       if (PinAvailable)
       {
         PinMask |= ((uint32)0xF8U << PinPosition);
       }

      PinPosition += 8U;
    }
    if((PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->IOCR0.U) & PinMask) != \
                                                        ((*DataPtr) & PinMask))
    {
      RetVal = 1U;
    }
  }
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
   due to PBConfigStructure and is within allowed range.*/
  DataPtr++;

  if(Port_lIsPortIocrAvailable(PortNo,(uint16)PORT_PIN_4_7)!= 0U)
  {
    PinPosition = 0U;
    PinMask = 0U;
    for(Index = 4U; Index<8U ; Index++)
    {

       PinAvailable  = Port_lIsPinAvailable(PortNo,Index);

       if (PinAvailable)
       {
         PinMask |= ((uint32)0xF8U << PinPosition);
       }
      PinPosition += 8U;
    }
    if((PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->IOCR4.U) & PinMask) != \
                                                        ((*DataPtr) & PinMask))
    {
      RetVal = 1U;
    }
  }
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
   due to PBConfigStructure and is within allowed range.*/
  DataPtr++;

  if(Port_lIsPortIocrAvailable(PortNo,(uint16)PORT_PIN_8_11)!= 0U)
  {
    PinPosition = 0U;
    PinMask = 0U;
    for(Index = 8U; Index<12U ; Index++)
    {

       PinAvailable  = Port_lIsPinAvailable(PortNo,Index);

       if (PinAvailable)
       {
         PinMask |= ((uint32)0xF8U << PinPosition);
       }
      PinPosition += 8U;
    }

