xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
    if((PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->IOCR8.U) & PinMask) != \
                                                        ((*DataPtr) & PinMask))
    {
      RetVal = 1U;
    }
  }
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
    due to PBConfigStructure and is within allowed range.*/
  DataPtr++;

  if(Port_lIsPortIocrAvailable(PortNo,(uint16)PORT_PIN_12_15)!= 0U)
  {
    PinPosition = 0U;
    PinMask = 0U;
    for(Index = 12U; Index<16U ; Index++)
    {

       PinAvailable  = Port_lIsPinAvailable(PortNo,Index);

       if (PinAvailable)
       {
         PinMask |= ((uint32)0xF8U << PinPosition);
       }
      PinPosition += 8U;
    }
    if((PORT_SFR_INIT_USER_MODE_READ32(PortAddressPtr->IOCR12.U) & PinMask) != \
                                                        ((*DataPtr) & PinMask))
    {
      RetVal = 1U;
    }
  }

  return(RetVal);
}


#endif

/* Enable / Disable the use of the function */
#if (PORT_SET_PIN_DIRECTION_API == STD_ON)
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_PORT141,DS_AS_PORT086,
                       DS_AS_PORT075_1,
                       DS_MCAL_PORT_0416,DS_AS_PORT063,DS_AS_PORT137,
                       DS_AS_PORT101_PORT211_2,DS_AS_PORT107_PORT146_2,
                       DS_AS4XX_PORT087_2,DS_AS3XX_PORT087_2,DS_AS_PORT054,
                       DS_AS_PORT213,
                       DS_AS_PORT138,DS_AS_PORT077,DS_NAS_PORT_PR912_1,
                       SAS_MCAL_PORT_0411,SAS_MCAL_PORT_0415,
                       DS_MCAL_PORT_0417, DS_AS_PORT107_PORT146_4,
                       DS_MCAL_PORT_0411_1]                                   **
**                                                                            **
** Syntax           : void Port_SetPinDirection                               **
**                    (                                                       **
**                      Port_PinType Pin,                                     **
**                      Port_PinDirectionType Direction                       **
**                    )                                                       **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : 0x01                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                    (Reentrant for pins of different port or pins assigned  **
**                     to different IOCR register of a same port)             **
**                                                                            **
** Parameters (in)  : Port_PinType Pin - port pin ID whose direction has      **
**                    to be set                                               **
**                    Port_PinDirectionType Direction - port pin direction    **
                      to be set                                               **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**  - PORT063: sets the port pin direction during runtime                     **
**  - PORT059: This functionality is available for parameter Pin              **
**     whose direction is configured as changeable during run time            **
**  - PORT086: This function is only available if the pre-compiler switch     **
**    PORT_SET_PIN_DIRECTION_API is set STD_ON.                               **
**                                                                            **
*******************************************************************************/
void Port_SetPinDirection(Port_PinType Pin, Port_PinDirectionType Direction)
{
  /* Each Port Number for the hardware unit  */
  uint32               PortNumber;
  uint32               PinNumber;
  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  uint8                ErrStatus;
  #if (PORT_DEV_ERROR_DETECT == STD_ON)
  uint32               PortAvailable;
  uint32               PortReadOnly;
  uint32               PinAvailable;
  #endif /*PORT_DEV_ERROR_DETECT == STD_ON */
  #endif /*PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON */
  uint32               ConfigIndex;
  uint32               Index;
  volatile uint32      *IocrRegPtr;
  const uint32         *DataPtr;
  Ifx_P                *PortAddressPtr;
  const uint8          *IocrDataPtr;

  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  ErrStatus = 0U;
  #endif

  #if (PORT_DEV_ERROR_DETECT == STD_ON)
  /* Check for DET: PORT_E_UNINIT */
  if (Port_InitStatus != PORT_INITIALIZED)
  {
    /* Report PORT_E_UNINIT DET if Port initialisation is not done */
    Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
        PORT_SID_SETPINDIRECTION,PORT_E_UNINIT);

    /* PORT087: Skip the API functionality and return from the API */
  }
  else
  #endif /* PORT_DEV_ERROR_DETECT */
  {
    /* Extract the port number and pin number from the Pin Symbolic ID */
    PortNumber = (uint32)Port_lNumber(Pin);
    PinNumber  = (uint32)Port_lPinNumber(Pin);

    #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
    /* PORT077: Function parameters are checked in the order in which they are
       passed.*/
    /* PORT087: Check if Pin is valid */

