xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
    #if (PORT_DEV_ERROR_DETECT == STD_ON)
    PortAvailable = Port_lIsPortAvailable(PortNumber);
    PortReadOnly  = Port_lIsPortReadOnly(PortNumber);

    PinAvailable = 0U;
    if( PortAvailable != 0U )
    {
      PinAvailable  = Port_lIsPinAvailable(PortNumber,PinNumber);
    }

    if ( (Pin > PORT_MAX_PIN_ID) ||
         ((PortReadOnly != 0U) || (PinAvailable == 0U))
       )
    {

      /*Report PORT_E_PARAM_PIN DET if the pin is out of range */
      Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
                PORT_SID_SETPINDIRECTION,PORT_E_PARAM_PIN);

      ErrStatus = 1U;
    }
    #endif

    #if (PORT_SAFETY_ENABLE == STD_ON)
    if(Pin > PORT_MAX_PIN_ID)
    {
      /*Report Safety Error if the pin is out of range */
      SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
         PORT_SID_SETPINDIRECTION,PORT_E_PARAM_PIN);

      ErrStatus = 1U;

    }

    if((Direction != PORT_PIN_IN) && (Direction != PORT_PIN_OUT))
    {
      /*Report Safety Error if the direction is out of range */
      SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
                      PORT_SID_SETPINDIRECTION,PORT_E_PARAM_DIRECTION);

      ErrStatus = 1U;

    }
    #endif
    #endif /* PORT_DEV_ERROR_DETECT and PORT_SAFETY_ENABLE */


    #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
    if (ErrStatus == 0U)
    #endif
    {
      ConfigIndex = 0U;
      for(Index = 0U;Index < PortNumber;Index++)
      {
        if(Port_lIsPortAvailable(Index) != 0U)
        {
          ConfigIndex++; /* to identify the Index of configuration*/
        }
      }

      /* Get the config data location for specified Port */
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range*/
      DataPtr =(const uint32*)(const void*)(
                (Port_kConfigPtr->PortConfigSetPtr)+ConfigIndex);

      /*parameter Pin is valid, check for pin direction changeable DET error */
      /*
      PORT059: PORT087: Check if the direction is configured as changeable or
      not
      */
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
      if ( ((*(DataPtr + PORT_DATA_OFS_DIR)) & ((uint32)0x01U << PinNumber))
             == PORT_PIN_DIR_NOT_CHANGEABLE
              )
      {
       #if (PORT_DEV_ERROR_DETECT == STD_ON)
         /* Report PORT_E_DIRECTION_UNCHANGEABLE DET if pin is configured for
            direction not changeable
         */
         Det_ReportError(
           (uint16)PORT_MODULE_ID,
           PORT_INSTANCE_ID,
           PORT_SID_SETPINDIRECTION,
           PORT_E_DIRECTION_UNCHANGEABLE);
       #endif /* PORT_DEV_ERROR_DETECT */
      }
      else
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range.*/
        IocrDataPtr = (const uint8*)(const void*)(DataPtr + PORT_DATA_OFS_CTL);

        /* Get Port Address */
        PortAddressPtr = Port_lAdr(PortNumber);
        /* Get the IOCR0 register address of particular port */
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
        IocrRegPtr = ((volatile uint32*)(volatile void*) \
                               PortAddressPtr + PORT_IOCR0_REG_OFFSET);

        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
           due to PBConfigStructure and is within allowed range*/
        if((*(IocrDataPtr + PinNumber) & (uint8)PORT_DIR_MSK)==(uint8)Direction)
        {
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
           due to PBConfigStructure and is within allowed range.*/
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
            to efficiently access the SFRs of PORT*/
          PORT_SFR_RUNTIME_USER_MODE_MODIFY32((*(IocrRegPtr + \
            (PinNumber / PORT_NUM_FOUR))),PORT_PIN_IOCR0_CLEARMASK(PinNumber), \
                                   ((uint32)(*(IocrDataPtr + PinNumber)) << \
                                     (PORT_IOCR0_BIT_SHIFT_COUNT(PinNumber))))
        }
        else
        {
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
             to efficiently access the SFRs of PORT*/
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
            due to PBConfigStructure and is within allowed range*/
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
            due to PBConfigStructure and is within allowed range*/
          PORT_SFR_RUNTIME_USER_MODE_MODIFY32((*(IocrRegPtr + \
          (PinNumber / PORT_NUM_FOUR))),PORT_PIN_IOCR0_CLEARMASK(PinNumber), \
                                           (*((DataPtr + PORT_DATA_OFS_CTL2) \
           + (PinNumber / PORT_NUM_FOUR)) & PORT_PIN_IOCR0_SETMASK(PinNumber)))
        }
      }
    }
  }
} /* Port_SetPinDirection */
#endif /* Direction changes allowed / Port_SetPinDirection API is ON */

/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_PORT142,DS_AS_PORT075_2,
                        DS_AS_PORT101_PORT211_3,DS_AS_PORT107_PORT146_3,
                        DS_AS4XX_PORT087_3,DS_AS3XX_PORT087_3,
                        DS_AS_PORT060_PORT061_PORT066,
                        DS_AS_PORT213,SAS_MCAL_PORT_0411,
                        DS_AS_PORT107_PORT146_4,DS_MCAL_PORT_0411_2]          **
**                                                                            **
** Syntax           : void Port_RefreshPortDirection ( void )                 **
**                                                                            **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : 0x02                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**   - PORT060: PORT061: PORT066: refreshes the direction for all the port    **
**     pins that are configured as direction not changeable during run time   **
**                                                                            **
*******************************************************************************/
void Port_RefreshPortDirection(void)
{
  uint32                LoopCtr;
  /* Each Port Number for the hardware unit  */
  uint32                PortNumber;
  uint32                ConfigIndex;
  #if (PORT_SET_PIN_DIRECTION_API == STD_ON)
  /* Direction changeable allowed */
  uint32                DirectionData;
  uint32                PinPos;
  #endif /* PORT_SET_PIN_DIRECTION_API */
  const uint32          *DataPtr;
  const uint8           *IocrDataPtr;
  volatile uint32       *IocrRegPtr;
  Ifx_P *PortAddressPtr;

