xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
  #if (PORT_DEV_ERROR_DETECT == STD_ON)
  /* Check for DET: PORT_E_UNINIT */
  if (Port_InitStatus != PORT_INITIALIZED)
  {
    /* Report PORT_E_UNINIT DET if Port initialisation is not done
    */
   Det_ReportError(
      (uint16)PORT_MODULE_ID,
      PORT_INSTANCE_ID,
      PORT_SID_REFRESHPORTDIR,
      PORT_E_UNINIT);
    /* PORT087: Skip the API functionality and return from the API */
  }
  else
  #endif /* (PORT_DEV_ERROR_DETECT) == STD_ON*/
  {
   /* Loop from Port 0 till last Port */
   PortNumber = 0U;
   ConfigIndex = 0U;
   do
   {
     if(Port_lIsPortAvailable(PortNumber) != 0U)
     {
       /* Pointer to the data for the port */
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
       DataPtr = (const uint32*)(const void*)
                 ((Port_kConfigPtr->PortConfigSetPtr) + ConfigIndex);

       #if (PORT_SET_PIN_DIRECTION_API == STD_ON)
       /* Direction changeable allowed */
       /* Get the direction changeable configuration for all the port pins */
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
       DirectionData = *(DataPtr + PORT_DATA_OFS_DIR);
       #endif /* PORT_SET_PIN_DIRECTION_API == STD_ON*/

       /* Pointer to control data for the first pin */
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
       IocrDataPtr = (const uint8*)(const void*)(DataPtr + PORT_DATA_OFS_CTL);

       /* Pointer to control register for the first pin */
       /* Get Port Address */
       PortAddressPtr = Port_lAdr(PortNumber);
       /* Get the IOCR0 register address of particular port */
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
       IocrRegPtr = ((volatile uint32 *)(volatile void*)PortAddressPtr + \
                                               PORT_IOCR0_REG_OFFSET);

       /* Start from the first pin */
       #if (PORT_SET_PIN_DIRECTION_API == STD_ON)
       PinPos = 0x01U;
       #endif /* PORT_SET_PIN_DIRECTION_API */

       LoopCtr = 0U;
       do
       {
        if(Port_lIsPinAvailable(PortNumber,LoopCtr) != 0U)
        {
          #if (PORT_SET_PIN_DIRECTION_API == STD_ON)
          /* Direction changeable is enabled */
          if ((DirectionData & PinPos) == PORT_PIN_DIR_NOT_CHANGEABLE)
          {
            /* Direction of the pin cannot be changed during run time */
            /* Write the default value to the control bit fields of the Pin */
            PORT_SFR_RUNTIME_USER_MODE_MODIFY32(*IocrRegPtr, \
                 PORT_PIN_IOCR0_CLEARMASK(LoopCtr),((uint32)(*IocrDataPtr) << \
                                         PORT_IOCR0_BIT_SHIFT_COUNT(LoopCtr)))
          }
          #else
            /* Direction changeable is disabled */
            /* Write the default value to the control bit fields of the Pin */
            PORT_SFR_RUNTIME_USER_MODE_MODIFY32(*IocrRegPtr, \
                 PORT_PIN_IOCR0_CLEARMASK(LoopCtr),((uint32)(*IocrDataPtr) << \
                                         PORT_IOCR0_BIT_SHIFT_COUNT(LoopCtr)))
          #endif /* PORT_SET_PIN_DIRECTION_API */
        }

        /* Loop for each pin in the port */
        LoopCtr++;

        if((uint32)(LoopCtr % PORT_NUM_FOUR) == 0U)
        {
          /* Increment to point to the next data set */
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range.*/
          IocrRegPtr++;
        }
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range.*/
        IocrDataPtr++;

        #if (PORT_SET_PIN_DIRECTION_API == STD_ON)
        /* Shift the pin position to next pin */
        PinPos = PinPos << 1U;
        #endif /* PORT_SET_PIN_DIRECTION_API */

       } while (LoopCtr <= PORT_PIN_MAX_NUMBER );

      ConfigIndex++;
     }
    PortNumber++;
   } while (PortNumber <= PORT_MAX_NUMBER); /* Loop for all the ports */
  }
}/* Port_RefreshPortDirection */

/* Enable / Disable the use of the function */
#if (PORT_SET_PIN_MODE_API == STD_ON)
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_PORT145,DS_AS_PORT125,
                        DS_AS_PORT128,DS_AS_PORT101_PORT211_5,
                        DS_AS_PORT107_PORT146_5,DS_AS4XX_PORT087_5,
                        DS_AS3XX_PORT087_5,
                        DS_AS4XX_PORT223,DS_AS_PORT213,DS_AS_PORT077,
                        DS_NAS_PORT_PR912_3,SAS_MCAL_PORT_0409,
                        SAS_MCAL_PORT_0415,SAS_MCAL_PORT_0410,
                        DS_MCAL_PORT_0417,DS_MCAL_PORT_0409]                  **
**                                                                            **
** Syntax           : void Port_SetPinMode                                    **
**                    (                                                       **
**                      Port_PinType Pin,                                     **
**                      Port_PinModeType Mode                                 **
**                    )                                                       **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : 0x04                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                    (Reentrant for pins of different port or pins assigned  **
**                     to different IOCR register of a same port              **
**                                                                            **
** Parameters (in)  : Port_PinType Pin - port pin ID whose mode has to be set **
**                    Port_PinModeType Mode - port pin mode to be set         **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**   - PORT125: Sets the port pin mode during runtime.                        **
**   - This function is available if the PORT_SET_PIN_MODE_API is set ON      **
**                                                                            **
*******************************************************************************/
void Port_SetPinMode(Port_PinType Pin, Port_PinModeType Mode)
{
  /* Each Port Number for the hardware unit  */
  uint32           PortNumber;
  uint32           PinNumber;
  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  uint32           ErrMode;
  uint8            ErrStatus;
  uint8            Direction;
  uint32           ConfigIndex;
  uint32           Index;
  const uint32     *DataPtr;
  #endif
  volatile uint32  *IocrRegPtr;
  Ifx_P            *PortAddressPtr;

  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  IocrRegPtr = NULL_PTR;
  ConfigIndex = 0U;
  #endif

  /* Extract the port number and pin number from the Pin Symbolic ID */
  PortNumber = (uint32)Port_lNumber(Pin);
  PinNumber  = (uint32)Port_lPinNumber(Pin);

