xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
  #if (PORT_DEV_ERROR_DETECT == STD_ON)
  if (Port_InitStatus != PORT_INITIALIZED)
  {
    /* Report PORT_E_UNINIT DET if Port initialisation is not done
    */
    Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
      PORT_SID_SETPINMODE,PORT_E_UNINIT);

    ErrStatus = 1U;
  }
  else
  #endif /* PORT_DEV_ERROR_DETECT == STD_ON */
  {
    #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
    /* PORT077: Function parameters are checked in the order in which they are
                passed.
    */
    /* PORT087: Check if Pin is valid */

    ErrStatus = Port_lChkPin(Pin,PortNumber,PinNumber);
    #endif

    #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
    if (ErrStatus == 0U)
    #endif
    {
      /* Get Port Address */
      PortAddressPtr = Port_lAdr(PortNumber);
      /* Get the IOCR0 register address of particular port */
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
      IocrRegPtr = ((volatile uint32*)\
                     (volatile void*)PortAddressPtr + PORT_IOCR0_REG_OFFSET);

      #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
      for(Index = 0U; Index < PortNumber;Index++)
      {
        if(Port_lIsPortAvailable(Index) != 0U)
        {
          ConfigIndex++; /* to identify the Index of configuration*/
        }
      }

        /* Get the config data location for specified Port */
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
      DataPtr =(const uint32*)(const void*)
               ((Port_kConfigPtr->PortConfigSetPtr)+ConfigIndex);

      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
      if ((((*(DataPtr + PORT_DATA_OFS_MODE)) & ((uint32)0x01U << PinNumber))
            == PORT_PIN_MODE_NOT_CHANGEABLE)
         )
      {
        /*PORT223: Report PORT_E_MODE_UNCHANGEABLE DET if the pin is configured
         as mode not changeable */
        #if (PORT_DEV_ERROR_DETECT == STD_ON)
        Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
          PORT_SID_SETPINMODE,PORT_E_MODE_UNCHANGEABLE);
        #endif

        ErrStatus = 1U;
      }
      else
      {

        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
        Direction = (uint8)((PORT_SFR_RUNTIME_USER_MODE_READ32(*(IocrRegPtr + \
           (PinNumber / PORT_NUM_FOUR))) & PORT_PIN_IOCR0_SETMASK(PinNumber)) \
                                     >> PORT_IOCR0_BIT_SHIFT_COUNT(PinNumber));

        ErrMode = Port_lModeErrChk(Direction, Mode, ConfigIndex, PinNumber);

        if (ErrMode == 1U)
        {
          #if (PORT_DEV_ERROR_DETECT == STD_ON)
          /* Report PORT_E_PARAM_INVALID_MODE DET if pin mode is not valid */
          Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
            PORT_SID_SETPINMODE,PORT_E_PARAM_INVALID_MODE);
          #endif


          /*Report Safety Error if the Mode is out of range */
          #if (PORT_SAFETY_ENABLE == STD_ON)
          SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
             PORT_SID_SETPINMODE,PORT_E_PARAM_INVALID_MODE);
          #endif

          ErrStatus = 1U;

        }
      }
      #endif
    }
  }

  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  if (ErrStatus == 0U)
  #endif
  {
    /* Set the new mode in IOCR register */
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
      to efficiently access the SFRs of PORT*/
    PORT_SFR_RUNTIME_USER_MODE_MODIFY32((*(IocrRegPtr + \
           (PinNumber / PORT_NUM_FOUR))),PORT_IOCR0_MODE_CLEARMASK(PinNumber), \
                        ((uint32)Mode << PORT_IOCR0_BIT_SHIFT_COUNT(PinNumber)))
  }
}/* Port_SetPinMode */

#if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lModeErrChk                **
**                    (                                                       **
**                      uint8 Dir,                                            **
**                      Port_PinModeType Mode,                                **
**                      uint32 ConfigIndex,                                   **
**                      uint32 PinNumber                                      **
**                    )                                                       **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                                                                            **
** Parameters (in)  : uint8 Dir - Current direction of a pin                  **
**                    Port_PinModeType Mode - port pin mode to be set         **
**                    uint32 ConfigIndex - Array Index                        **
**                    uint32 PinNumber - port pin number                      **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    0 -No error in the pin mode set                         **
**                    1 -Error in the pin mode set                            **
**                                                                            **
** Description      : This function:                                          **
**   - Checks for the error.                                                  **
**   - This function is available if the PORT_SET_PIN_MODE_API is set ON      **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lModeErrChk
(
  uint8 Dir, Port_PinModeType Mode, uint32 ConfigIndex, uint32 PinNumber
)
{
  uint32 ErrStatus;

