xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
  ErrStatus = 0U;

  /* parameter Pin is valid, check for the pin valid mode */
  if ((Dir & (uint8)PORT_DIR_MSK) == (uint8)PORT_PIN_IN)
  {
    if (Mode != (Port_PinModeType)PORT_PIN_MODE_GPIO)
    {
      ErrStatus = 1U;
    }
  }
  else if ( (Mode & AVAILABLE_MODE_MASK) != 0U)
  {
    ErrStatus = 1U;
  }
  else
  {
    uint32 Position;        /* Variables for determining if the specified*/
    uint32 Mode_supported;  /* mode is supported or not */

    Position = Mode >> PORT_IOCR_PC_POS;
    Mode_supported = (uint32)1U << Position;

    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
      due to PBConfigStructure and is within allowed range*/
    if(((uint32)(Port_kConfigPtr->
                  PortPinHwSupportedModes[ConfigIndex].U[PinNumber]) &
          Mode_supported ) == 0U
      )
    {
      ErrStatus = 1U;
    }
  }

  return(ErrStatus);
}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint8 Port_lChkPin                     **
**                    (                                                       **
**                      Port_PinType Pin,                                     **
**                      uint32 PortNo,                                        **
**                      uint32 PinNo                                          **
**                    )                                                       **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                                                                            **
** Parameters (in)  : Port_PinType pin - pin ID whose mode has to be set      **
**                    uint32 PinNo - port pin number                          **
**                    uint32 PortNo - port number                             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : uint8                                                   **
**                    0 - No error if portpin is available                    **
**                    1 - Error if portpin is not available                   **
**                                                                            **
** Description      : This function:                                          **
**   - Checks for the error.                                                  **
**   - This function is available if the PORT_SET_PIN_MODE_API is set ON      **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE uint8 Port_lChkPin(Port_PinType Pin,uint32 PortNo,uint32 PinNo)
{
  uint8 RetVal;
  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))
  uint32 PortReadOnly;
  uint32 PinAvailable;
  uint32 PortAvailable;
  #endif

  RetVal = 0U;
  #if ((PORT_DEV_ERROR_DETECT == STD_OFF) && (PORT_SAFETY_ENABLE == STD_OFF))
  UNUSED_PARAMETER(PortNo)
  UNUSED_PARAMETER(PinNo)
  #endif

  #if ((PORT_DEV_ERROR_DETECT == STD_ON) || (PORT_SAFETY_ENABLE == STD_ON))

  PortAvailable = Port_lIsPortAvailable(PortNo);
  PortReadOnly  = Port_lIsPortReadOnly(PortNo);

  if( PortAvailable != 0U )
  {
    PinAvailable  = Port_lIsPinAvailable(PortNo,PinNo);
  }
  else
  {
    /* If Port is not available, then Pin also Not available */
    PinAvailable = 0U;
  }


  if ( (Pin > PORT_MAX_PIN_ID) ||
        ((PortReadOnly != 0U) || (PinAvailable == 0U))
     )
  {
  #if (PORT_DEV_ERROR_DETECT == STD_ON)
    /*Report PORT_E_PARAM_PIN DET if the pin is out of range */
    Det_ReportError((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
      PORT_SID_SETPINMODE,PORT_E_PARAM_PIN);

  #endif

  #if (PORT_SAFETY_ENABLE == STD_ON)
    /*Report Safety Error if the pin is out of range */
    SafeMcal_ReportError ((uint16)PORT_MODULE_ID,PORT_INSTANCE_ID,
        PORT_SID_SETPINMODE,PORT_E_PARAM_PIN);

  #endif

  RetVal = 1U;
  }

  #endif

 return(RetVal);

}
#endif /* (PORT_DEV_ERROR_DETECT == STD_ON) */
#endif /* (PORT_SET_PIN_MODE_API == STD_ON) */
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_PORT043_PORT055,
                       DS_AS_PORT001_PORT002_PORT041,DS_AS_PORT214,
                       DS_AS_PORT042]                                         **
**                                                                            **
** Syntax           : IFX_LOCAL_INLINE void Port_lIOInit(void)                **
**                                                                            **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : None Re-entrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**   - INLINE function to initialize Port registers                           **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void Port_lIOInit(void)
{
  const uint32            *DataPtr;
  const Port_n_ConfigType *ConfigDataPtr;
  /* Each Port Number for the hardware unit */
  uint32                   PortNumber;
  /* Each Port level for the hardware unit */
  uint32                   PortLevel;
  /* Index to identify the port configuration information
  from the configuration array  */
  uint32                   ConfigIndex;
  Ifx_P                   *PortAddressPtr;
  const uint32            *PCSRDataPtr;
  volatile uint32         *PCSRRegPtr;

  /* Function call to initialize PDR registers */
  Port_lPDRInit();

