xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
  ConfigIndex = 0U;


  PCSRDataPtr = (const uint32*)(const void*)
                               (Port_kConfigPtr->Port_PCSRConfigTypePtr);

  /* writing P_OUT and IOCR registers */
  for (PortNumber = 0U; PortNumber <= PORT_MAX_NUMBER ; PortNumber++)
  {

    if(Port_lIsPortAvailable(PortNumber) != 0U)
    {
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
      ConfigDataPtr = (Port_kConfigPtr->PortConfigSetPtr) + ConfigIndex ;

      /* Address of each port configuration */
      DataPtr = (const uint32 *)(const void*)(ConfigDataPtr);

      PortAddressPtr = Port_lAdr(PortNumber);

      /*
       PORT043: PORT055: OUT register is written before IOCR bit field to avoid
       the glitches on the pin
      */
      if(Port_lIsPortReadOnly(PortNumber) == 0U)
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
        PortLevel = (*(DataPtr + PORT_DATA_OFS_LEVEL));
        PORT_SFR_INIT_USER_MODE_WRITE32(
                          PortAddressPtr->OMR.U, Port_lPinLevel(PortLevel));
      }

      if(Port_lIsPortIocrAvailable(PortNumber,(uint16)PORT_PIN_0_3)!= 0U)
      {
        PORT_SFR_INIT_USER_MODE_WRITE32(PortAddressPtr->IOCR0.U, *DataPtr);
      }
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range.*/
      DataPtr++;

      if(Port_lIsPortIocrAvailable(PortNumber,(uint16)PORT_PIN_4_7) != 0U)
      {
        PORT_SFR_INIT_USER_MODE_WRITE32(PortAddressPtr->IOCR4.U, *DataPtr);
      }
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range.*/
      DataPtr++;

      if(Port_lIsPortIocrAvailable(PortNumber,(uint16)PORT_PIN_8_11)!= 0U)
      {
        PORT_SFR_INIT_USER_MODE_WRITE32(PortAddressPtr->IOCR8.U, *DataPtr);
      }
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range.*/
      DataPtr++;

      if(Port_lIsPortIocrAvailable(PortNumber,(uint16)PORT_PIN_12_15)!= 0U)
      {
        PORT_SFR_INIT_USER_MODE_WRITE32(PortAddressPtr->IOCR12.U, *DataPtr);
      }


      if(Port_lIsPortPCSRAvailable(PortNumber) != 0U)
      {
         /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
          to efficiently access the SFRs of PORT*/
         PCSRRegPtr = ((volatile uint32*)(volatile void*)PortAddressPtr +
                                         PORT_PCSR_REG_OFFSET);
         PORT_SFR_INIT_RESETSAFETYENDINIT_TIMED(PORT_ENDINIT_TIMEOUT);
         /* PCSRn */
         PORT_SFR_INIT_WRITE32((*PCSRRegPtr),(*PCSRDataPtr));
         PORT_SFR_INIT_SETSAFETYENDINIT_TIMED();

         /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
          due to PBConfigStructure and is within allowed range.*/
         PCSRDataPtr++;
      }

      ConfigIndex++;
    }
  } /* For loop */

  /* Initialize PORT 40 Pad Disable control register */
  /* Reset endinit protect */
  PORT_SFR_INIT_RESETENDINIT();

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
    to efficiently access the SFRs of PORT*/
  PORT_SFR_INIT_WRITE32(P40_PDISC.U,Port_kConfigPtr->PDiscSet[0U]);

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
    to efficiently access the SFRs of PORT*/
  PORT_SFR_INIT_WRITE32(P41_PDISC.U,Port_kConfigPtr->PDiscSet[1U]);

  /* Set endinit protect */
  PORT_SFR_INIT_SETENDINIT();

}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Port_lPDRInit(void)               **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : None Re-entrant                                         **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
** Description      : This function:                                          **
**   - INLINE function to initialize Port PDR registers                       **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void Port_lPDRInit(void)
{
  /* Each Port Number for the hardware unit  */
  uint32                  PortNumber;
  /* Index to identify the port configuration information
  from the configuration array  */
  uint32                  ConfigIndex;
  Ifx_P            *PortAddressPtr;

  ConfigIndex = 0U;
  /* Reset endinit protect */

  /* Port driver strength is configured in Port PDR0 register */
  for (PortNumber = 0U; PortNumber < PORT_MAX_NUMBER ; PortNumber++)
  {
    /* Parameter Port is checked for validity */
    if(Port_lIsPortAvailable(PortNumber) != 0U)
    {
      PORT_SFR_INIT_RESETENDINIT();
      PortAddressPtr = Port_lAdr(PortNumber);
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
      PORT_SFR_INIT_WRITE32((PortAddressPtr->PDR0.U),\
        Port_kConfigPtr->PortConfigSetPtr[ConfigIndex].DriverStrength0);

      if(Port_lIsPortPdr1Available(PortNumber) != 0U)
      {
        PortAddressPtr = Port_lAdr(PortNumber);
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used
        due to PBConfigStructure and is within allowed range*/
        PORT_SFR_INIT_WRITE32((PortAddressPtr->PDR1.U),\
               Port_kConfigPtr->PortConfigSetPtr[ConfigIndex].DriverStrength1);
      }
      PORT_SFR_INIT_SETENDINIT();
      ConfigIndex++;
    }
  }/* For loop */
}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE Ifx_P * Port_lAdr                      **
**                    (                                                       **
**                      uint32 PortNumber                                     **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 PortNumber                                       **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : Ifx_P *RetVal -Return the port adresses.                **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to extract the Address of Px_OUT              **
**   register.                                                                **
*******************************************************************************/
IFX_LOCAL_INLINE Ifx_P * Port_lAdr(uint32 PortNumber)
{
  Ifx_P *RetVal;

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used
    to efficiently access the SFRs of PORT*/
  RetVal = ( ((Ifx_P *)(void *)&P00_OUT +
              (((PortNumber / PORT_CONSTANT_10) * PORT_CONSTANT_16) +
              (PortNumber % PORT_CONSTANT_10)))
           );
  return(RetVal);
}


