xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly31          **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether the Port          **
**                    is read only or not                                     **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port is read only or          **
**   it is writable.                                                          **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly31(uint32 Port)
{
  uint32 RetVal;

  RetVal = ( ((uint32)(PORT_CONSTANT_0x01) << (Port)) &
             ((uint32)PORTS_READONLY_00_31)
            );
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly40          **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether the Port          **
**                    is read only or not                                     **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port is read only or          **
**   it is writable.                                                          **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly40(uint32 Port)
{
  uint32 RetVal;

  RetVal = ( ((uint32)(PORT_CONSTANT_0x01) << (Port - PORT_NUMBER_32)) &
             ((uint32)PORTS_READONLY_32_63)
            );
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly            **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether the Port          **
**                    is read only or not                                     **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port is read only or          **
**   it is writable.                                                          **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortReadOnly(uint32 Port)
{
  uint32 RetVal;

  RetVal = ((Port <= PORT_NUMBER_31) ? (Port_lIsPortReadOnly31(Port)) :
                                         (Port_lIsPortReadOnly40(Port))
            );
  return(RetVal);
}

