xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint16 Port_lIsPinAvailable            **
**                    (                                                       **
**                      uint32 Port,uint32 Pin                                **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port,uint32 Pin - Port and Pin to be checked     **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint16                                                  **
**                    RetVal -Value which denotes whether the Pin is present  **
**                    on the Port or not.                                     **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port pin is available or not  **
**   for the microcontroller.                                                 **
*******************************************************************************/
IFX_LOCAL_INLINE uint16 Port_lIsPinAvailable(uint32 Port,uint32 Pin)
{
  uint16 RetVal;

  RetVal = (uint16)( ((uint32)PORT_CONSTANT_0x01 << (Pin)) &
                      (Port_kAvailablePins[(Port)])
                   );
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint16 Port_lIsPortPdr1Available       **
**                    (                                                       **
**                     uint32 Port                                            **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint16                                                  **
**                    RetValue -Value which denotes whether PDR1 register     **
**                    present for the port or not                             **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if any of the port pin 8 - 15        **
**   is available or not for the microcontroller.                             **
*******************************************************************************/
IFX_LOCAL_INLINE uint16 Port_lIsPortPdr1Available(uint32 Port)
{
  uint16 RetVal;

  RetVal = (uint16)(((uint32)(PORT_PDR1_MASK)) & (Port_kAvailablePins[(Port)]));
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint16 Port_lIsPortIocrAvailable       **
**                    (                                                       **
**                      uint32 Port,uint16 Pin                                **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port,uint16 Pin - Port and Pin to be checked     **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint16                                                  **
**                    RetValue -Value which denotes whether Iocr register     **
**                    is available or not for the microcontroller             **
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the IOCRx register for the port   **
**   is available or not for the microcontroller.                             **
*******************************************************************************/
IFX_LOCAL_INLINE uint16 Port_lIsPortIocrAvailable(uint32 Port,uint16 Pin)
{
  uint16 RetVal;

  RetVal = (uint16)( ((uint32)(Pin)) & (Port_kAvailablePins[(Port)]) );
  return(RetVal);
}

