xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
#if((PORT_SET_PIN_DIRECTION_API == STD_ON) || (PORT_SET_PIN_MODE_API == STD_ON))
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lNumber                    **
**                    (                                                       **
**                      Port_PinType pin                                      **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : Port_PinType Pin                                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes port number extracted     **
**                    from pin symbolic ID                                    **
**                                                                            **
** Description      :                                                         **
** - Defines to extract port number Port_PinType data, bit4 to bit 11 (8 bit) **
**   represents the Port Number, to get that value Right shifted              **
**   by 4 and Mask with 0xFF                                                  **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lNumber(Port_PinType Pin)
{
   uint32 RetVal;

   RetVal = (((Pin) >> PORT_NUMBER_OFFSET) & PORT_NUM_LOW8_MASK);
   return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lPinNumber                 **
**                    (                                                       **
**                      Port_PinType pin                                      **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : Port_PinType Pin                                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
* Return value     : uint32                                                   **
**                   RetValue -Value which denotes pin number extracted       **
**                   from pin symbolic ID                                     **
**                                                                            **
** Description      :                                                         **
**  -Defines to extract pin number from Port_PinType data                     **
**   least significant 4-bit represents the Pin Number, to get that           **
**   value Masked with 0x0F                                                   **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lPinNumber(Port_PinType Pin)
{
   uint32 RetVal;

   RetVal = ((Pin) & PORT_PIN_LOW4_MASK);

   return(RetVal);
}
#endif

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lPinLevel                  **
**                    (                                                       **
**                      uint32 level                                          **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Level                                            **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetVal - Value to be set for the OMR register           **
**                                                                            **
** Description      :                                                         **
** -OMR register value to set the configured initial level                    **
**  To get the port pin level Masked with 0x0000FFFFU and left shited by 16   **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lPinLevel(uint32 Level)
{
  uint32 RetVal;

  RetVal = ((((~(Level)) & PORT_LOWER_16BIT_MASK) << PORT_16BIT_SHIFTVALUE) |
              (Level)
           );

  return(RetVal);
}


