xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/port_infineon_tricore/ssc/src/Port.c
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable31     **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether Port supports PCSR**
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port supports PCSR            **
**   for the microcontroller.                                                 **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable31(uint32 Port)
{
  uint32 RetVal;

  RetVal = ( ((uint32)(PORT_CONSTANT_0x01) << (Port)) &
             ((uint32)PORTS_PCSR_00_31)
           );
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable40     **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether Port supports PCSR**
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port supports PCSR            **
**   for the microcontroller.                                                 **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable40(uint32 Port)
{
  uint32 RetVal;

  RetVal = ( ((uint32)(PORT_CONSTANT_0x01) << (Port - PORT_NUMBER_32)) &
             ((uint32)PORTS_PCSR_32_63)
           );
  return(RetVal);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable       **
**                    (                                                       **
**                      uint32 Port                                           **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in)  : uint32 Port - Port to be checked                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32                                                  **
**                    RetValue -Value which denotes whether Port supports PCSR**
**                                                                            **
** Description      :                                                         **
** - The function like macro is to check if the port supports PCSR            **
**   for the microcontroller.                                                 **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Port_lIsPortPCSRAvailable(uint32 Port)
{
  uint32 RetVal;

  RetVal = ((Port > PORT_NUMBER_31) ? (Port_lIsPortPCSRAvailable40(Port)) :
            (Port_lIsPortPCSRAvailable31(Port))
           );
  return(RetVal);
}
/*Memory Map of the PORT Code*/
#define PORT_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
